Update - We have tried few scenarios from our end but were not able to see the above mentioned points. Have requested for a small session to work together and reproduce this scenario.

When tried below - 

```hcl
resource "ibm_is_vpn_gateway" "vpn_gateway" {
    name = "pstest-1"
    subnet = "02n7-7fececaf-3725-4168-8e73-9506b93673de"
}

resource "ibm_is_vpn_gateway_connection" "conn" {
    vpn_gateway = ibm_is_vpn_gateway.vpn_gateway.id
    name = "ps-conn-1"
    preshared_key = var.preshared_key
    peer {
        address = "162.133.137.63"
        cidrs = ["172.16.10.0/24"]
    }
    local {
        cidrs = ["172.16.10.0/24"]
    }
}


# Import blocks
import {
    to = ibm_is_vpn_gateway_connection.conn
    id = "02n7-a9c9fe16-7c1c-4886-a376-de887b94df74/02n7-df14bbdb-4a06-4543-bc63-a26700be873f"
}

import {
    to = ibm_is_vpn_gateway.vpn_gateway
    id = "02n7-a9c9fe16-7c1c-4886-a376-de887b94df74"
}
```
The output is seen as -

```sh
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ibm_is_vpn_gateway.vpn_gateway must be replaced
  # (imported from "02n7-a9c9fe16-7c1c-4886-a376-de887b94df74")
  # Warning: this will destroy the imported resource
-/+ resource "ibm_is_vpn_gateway" "vpn_gateway" {
      ~ access_tags             = [] -> (known after apply)
      ~ created_at              = "2026-03-30T07:06:42.451Z" -> (known after apply)
      ~ crn                     = "crn:v1:bluemix:public:is:jp-osa:a/abac0df06b644a9cabc6e44f55b3880e::vpn:02n7-a9c9fe16-7c1c-4886-a376-de887b94df74" -> (known after apply)
      ~ health_reasons          = [] -> (known after apply)
      ~ health_state            = "ok" -> (known after apply)
      ~ id                      = "02n7-a9c9fe16-7c1c-4886-a376-de887b94df74" -> (known after apply)
      ~ lifecycle_reasons       = [] -> (known after apply)
      ~ lifecycle_state         = "stable" -> (known after apply)
      ~ members                 = [
          - {
              - address         = "163.68.85.82"
              - private_address = "10.248.0.4"
              - role            = "active"
                status          = null
            },
          - {
              - address         = "0.0.0.0"
              - private_address = "10.248.0.5"
              - role            = "standby"
                status          = null
            },
        ] -> (known after apply)
      ~ mode                    = "policy" -> "route" # forces replacement
      ~ name                    = "ps-vpn-gateway" -> "pstest-1"
      ~ private_ip_address      = "10.248.0.4" -> (known after apply)
      ~ private_ip_address2     = "10.248.0.5" -> (known after apply)
      ~ public_ip_address       = "163.68.85.82" -> (known after apply)
      ~ public_ip_address2      = "0.0.0.0" -> (known after apply)
      ~ resource_controller_url = "https://cloud.ibm.com/vpc/network/vpngateways" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:jp-osa:a/abac0df06b644a9cabc6e44f55b3880e::vpn:02n7-a9c9fe16-7c1c-4886-a376-de887b94df74" -> (known after apply)
      ~ resource_group          = "3c6140d6955c45fca3690f992ac4362f" -> (known after apply)
      ~ resource_group_name     = "prateek-rg" -> (known after apply)
      ~ resource_name           = "ps-vpn-gateway" -> (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
        subnet                  = "02n7-7fececaf-3725-4168-8e73-9506b93673de"
      ~ tags                    = [
          - "single-site",
          - "site-to-site-vpn",
        ] -> (known after apply)
      ~ vpc                     = [
          - {
              - crn     = "crn:v1:bluemix:public:is:jp-osa:a/abac0df06b644a9cabc6e44f55b3880e::vpc:r034-bdc09e93-fbeb-40c8-9f4e-5c57704a8cb6"
              - deleted = []
              - href    = "https://jp-osa.iaas.cloud.ibm.com/v1/vpcs/r034-bdc09e93-fbeb-40c8-9f4e-5c57704a8cb6"
              - id      = "r034-bdc09e93-fbeb-40c8-9f4e-5c57704a8cb6"
              - name    = "ps-vpc"
            },
        ] -> (known after apply)
    }

  # ibm_is_vpn_gateway_connection.conn must be replaced
  # (imported from "02n7-a9c9fe16-7c1c-4886-a376-de887b94df74/02n7-df14bbdb-4a06-4543-bc63-a26700be873f")
  # Warning: this will destroy the imported resource
-/+ resource "ibm_is_vpn_gateway_connection" "conn" {
        action              = "restart"
      ~ admin_state_up      = false -> (known after apply)
      ~ authentication_mode = "psk" -> (known after apply)
      ~ created_at          = "2026-03-30T07:09:35.457Z" -> (known after apply)
      + distribute_traffic  = false
        establish_mode      = "bidirectional"
      ~ gateway_connection  = "02n7-df14bbdb-4a06-4543-bc63-a26700be873f" -> (known after apply)
      ~ href                = "https://jp-osa.iaas.cloud.ibm.com/v1/vpn_gateways/02n7-a9c9fe16-7c1c-4886-a376-de887b94df74/connections/02n7-df14bbdb-4a06-4543-bc63-a26700be873f" -> (known after apply)
      ~ id                  = "02n7-a9c9fe16-7c1c-4886-a376-de887b94df74/02n7-df14bbdb-4a06-4543-bc63-a26700be873f" -> (known after apply)
      - ike_policy          = "r034-08a9059d-e4d5-47d7-82e9-66c02f48b011" -> null
        interval            = 2
      - ipsec_policy        = "r034-a7c3b5f9-4e10-4316-8cc8-b141022ff8b4" -> null
      ~ local_cidrs         = [
          - "172.16.10.0/24",
        ] -> (known after apply)
      ~ mode                = "policy" -> (known after apply)
        name                = "ps-vpn-conn"
      ~ peer_address        = "162.133.137.63" -> (known after apply)
      ~ peer_cidrs          = [
          - "10.100.10.0/24",
        ] -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ preshared_key       = (sensitive value)
      ~ related_crn         = "crn:v1:bluemix:public:is:jp-osa:a/abac0df06b644a9cabc6e44f55b3880e::vpn:02n7-a9c9fe16-7c1c-4886-a376-de887b94df74" -> (known after apply)
      ~ resource_type       = "vpn_gateway_connection" -> (known after apply)
      + routing_protocol    = (known after apply)
      ~ status              = "down" -> (known after apply)
      ~ status_reasons      = [] -> (known after apply)
        timeout             = 10
      ~ tunnels             = [] -> (known after apply)
      + vpn_gateway         = (known after apply) # forces replacement

      ~ local {
            cidrs = [
                "172.16.10.0/24",
            ]

          ~ ike_identities (known after apply)
          - ike_identities {
              - type  = "ipv4_address" -> null
              - value = "163.68.85.82" -> null
            }
        }

      ~ peer {
            address = "162.133.137.63"
          ~ cidrs   = [
              - "10.100.10.0/24",
              + "172.16.10.0/24",
            ]
          + fqdn    = (known after apply)
          ~ type    = "address" -> (known after apply)

          ~ ike_identity (known after apply)
          - ike_identity {
              - type  = "ipv4_address" -> null
              - value = "162.133.137.63" -> null
            }
        }
    }

Plan: 2 to import, 2 to add, 0 to change, 2 to destroy.
```

When applied the config, apply successful and next plan too was passed

<img width="297" height="22" alt="Image" src="https://github.com/user-attachments/assets/16fffaec-ee84-4dd7-9b18-39d7b2c0e404" />


